app/views/lines/_form.html.erb

SELECT "stations".* FROM "stations"
---
  <div class="form-group">
    <%= f.collection_check_boxes :station_ids, Station.all, :id, :name %>