app/views/lines/show.html.erb

SELECT "stations".* FROM "stations" INNER JOIN "stops" ON "stations"."id" = "stops"."station_id" WHERE "stops"."line_id" = $1  [["line_id", 1]]
---

<% @line.stations.each do |station| %>