app/views/stations/index.html.erb

SELECT "lines".* FROM "lines" INNER JOIN "stops" ON "lines"."id" = "stops"."line_id" WHERE "stops"."station_id" = $1  [["station_id", 1]]
---
    <p> Lines that Run Through This Station </p>
     <% station.lines.each do |line| %>