app/views/stations/show.html.erb

SELECT "lines".* FROM "lines" INNER JOIN "stops" ON "lines"."id" = "stops"."line_id" WHERE "stops"."station_id" = $1  [["station_id", 3]]
---

<% @station.lines.each do |line| %>