app/views/stops/_form.html.erb

    <%= f.label :station_id %>
    <%= f.collection_select :station_id, Station.all, :id, :name %>
---
SELECT "stations".* FROM "stations"

    <%= f.label :line_id %>
    <%= f.collection_select :line_id, Line.all, :id, :name %>
---
SELECT "lines".* FROM "lines"