app/controllers/lines_controller.rb

SELECT "lines".* FROM "lines"
---
  def index
    @lines = Line.all  #No need to specify render

INSERT INTO "lines" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Orange Line"], ["created_at", "2015-01-30 13:36:50.855325"], ["updated_at", "2015-01-30 13:36:50.855325"]]
---
  def create
    @line = Line.new(line_params)  #line_params replaces params[:line], referencing method below
    if @line.save

SELECT  "lines".* FROM "lines" WHERE "lines"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @line = Line.find(params[:id])

SELECT  "lines".* FROM "lines" WHERE "lines"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @line = Line.find(params[:id])

SELECT  "lines".* FROM "lines" WHERE "lines"."id" = $1 LIMIT 1  [["id", 2]]
---
  def update
    @line = Line.find(params[:id])