app/controllers/stations_controller.rb

SELECT "stations".* FROM "stations"
---
  def index
    @stations = Station.all  #No need to specify render

INSERT INTO "stations" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Wiehle Avenue"], ["created_at", "2015-01-29 21:52:16.255008"], ["updated_at", "2015-01-29 21:52:16.255008"]]
---
  def create
    @station = Station.new(station_params)  #station_params replaces params[:station], referencing method below
    if @station.save

SELECT  "stations".* FROM "stations" WHERE "stations"."id" = $1 LIMIT 1  [["id", 3]]
---
  def show
    @station = Station.find(params[:id])