app/controllers/stops_controller.rb

SELECT "stops".* FROM "stops"
---
  def index
    @stops = Stop.all  #No need to specify render

INSERT INTO "stops" ("station_id", "line_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["station_id", 1], ["line_id", 1], ["created_at", "2015-01-30 15:37:32.249067"], ["updated_at", "2015-01-30 15:37:32.249067"]]
---
  def create
    @stop = Stop.new(stop_params)  #stop_params replaces params[:stop], referencing method below
    if @stop.save

SELECT  "stops".* FROM "stops" WHERE "stops"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "stations".* FROM "stations" WHERE "stations"."id" = $1  ORDER BY "stations"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "lines".* FROM "lines" WHERE "lines"."id" = $1  ORDER BY "lines"."id" ASC LIMIT 1  [["id", 1]]
---
  def show
    @stop = Stop.find(params[:id])
    @station = Station.where(:id => @stop.station_id).first
    @line = Line.where(:id => @stop.line_id).first

SELECT  "stops".* FROM "stops" WHERE "stops"."id" = $1 LIMIT 1  [["id", 5]]
---
  def edit
    @stop = Stop.find(params[:id])

SELECT  "stops".* FROM "stops" WHERE "stops"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "stops" SET "line_id" = $1, "updated_at" = $2 WHERE "stops"."id" = $3  [["line_id", 2], ["updated_at", "2015-01-31 14:40:21.727532"], ["id", 5]]
---
  def update
    @stop = Stop.find(params[:id])
    if @stop.update(stop_params)

SELECT  "stops".* FROM "stops" WHERE "stops"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "stops" WHERE "stops"."id" = $1  [["id", 2]]
---
 def destroy
    @stop = Stop.find(params[:id])
    @stop.destroy